{
  "backend/main.mo": "Motoko canister handling user profiles and reward point accounts with access control and CRUD operations for profiles and redemption options.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to associated frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing several frontend reward-related components and styling configuration in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining global OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main bundle.",
  "frontend/src/App.tsx": "Sets up routing, authentication gating, and global providers including theming and toast notifications.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper that blocks rendering until Internet Identity is initialized and authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save a profile name.",
  "frontend/src/components/dashboard/CategoryBreakdownChart.tsx": "Renders a category spending breakdown card with color-coded bars and percentages.",
  "frontend/src/components/dashboard/DateRangePicker.tsx": "Date range selector with preset ranges and a popover UI for analytics filtering.",
  "frontend/src/components/dashboard/MonthlyTotalsChart.tsx": "Renders a monthly spending bar chart with proportional bar widths and fallback UI when no data is provided.",
  "frontend/src/components/dashboard/PointsEstimateSummary.tsx": "Calculates and displays estimated reward points from transactions, highlighting total points and top earning categories.",
  "frontend/src/components/dashboard/TopMerchantsList.tsx": "Shows the top merchants ranked by transaction frequency and total spend, with a simple empty‑state fallback.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout shell with header navigation, user greeting, routed content outlet, and footer branding.",
  "frontend/src/components/rewards/RedemptionOptionForm.tsx": "Provides a form to add a redemption option, including CPP preview and submission to backend via mutation hook.",
  "frontend/src/components/rewards/RedemptionRecommendations.tsx": "Generates ranked redemption recommendations based on advisory settings and allows sorting by CPP or net value.",
  "frontend/src/components/rewards/RewardProfileForm.tsx": "Simple form for creating a new reward profile by entering a point balance and submitting it to the backend.",
  "frontend/src/components/rewards/RewardProfilesList.tsx": "Lists reward profiles and their redemption options, supporting adding new options and displaying CPP and net value per option.",
  "frontend/src/components/settings/EarningRatesEditor.tsx": "UI component that displays earning rate inputs per category and example point calculations using values from useEarningRates.",
  "frontend/src/components/transactions/CsvImportWizard.tsx": "Wizard for uploading, mapping, previewing, and importing CSV transaction data with validation and bulk add support.",
  "frontend/src/components/transactions/TransactionFilters.tsx": "Filter panel allowing users to filter transactions by date, merchant, category, and card label, with a reset option.",
  "frontend/src/components/transactions/TransactionForm.tsx": "Form for creating or editing a transaction, handling validation, state management, and save mutations.",
  "frontend/src/components/transactions/TransactionsTable.tsx": "Table that displays transactions with edit and delete actions and a confirmation dialog for deletions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the current user's profile via the backend actor using react-query.",
  "frontend/src/hooks/useEarningRates.ts": "Hook that manages earning rate settings in localStorage and exposes update functions for categories and card overrides.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status.",
  "frontend/src/hooks/useRewardAdvisorySettings.ts": "Stores and updates advisory settings in local storage, exposing current values and an update helper.",
  "frontend/src/hooks/useRewardProfiles.ts": "Fetches reward profiles and provides mutations to add profiles or redemption options using a backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Manages transactions stored in local storage with querying and mutations for add, update, delete, and bulk import.",
  "frontend/src/index.css": "Defines Tailwind base styles and design tokens for light and dark themes using CSS variables.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard showing spending analytics, charts, and date filtering based on stored transactions.",
  "frontend/src/pages/HelpPage.tsx": "Displays a help and guidance page with disclaimers and instructions for using key app features.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing marketing content, feature cards, and login actions for SpendWise.",
  "frontend/src/pages/RewardsPage.tsx": "Rewards management UI with tabs for reward programs, recommendations, and earning rate settings.",
  "frontend/src/pages/TransactionsPage.tsx": "Transactions management page with filtering, CSV import, and add/edit dialogs.",
  "frontend/src/types/earningRates.ts": "Types defining earning rate structures and point estimate outputs.",
  "frontend/src/types/rewards.ts": "Reward types including extended profiles with calculated CPP and net values.",
  "frontend/src/types/transactions.ts": "Transaction and filter types plus helpers for categories, currencies, formatting, and date parsing.",
  "frontend/src/utils/analytics.ts": "Computes spending analytics including totals, category breakdowns, merchants, and trends.",
  "frontend/src/utils/csv.ts": "Parses CSV text, coerces amounts and dates, and returns structured rows with warnings.",
  "frontend/src/utils/pointsEstimate.ts": "Calculates points earned by category using earning rates and optional card overrides.",
  "frontend/src/utils/recommendations.ts": "Ranks redemption options by CPP and net value with explanations and low-value flags.",
  "frontend/src/utils/rewardsMath.ts": "Utility math for CPP, net value calculations, and formatting.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and remove sensitive params from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, features, requirements, and image needs for a credit card spending and reward‑analysis app."
}