{
  "kind": "build_request",
  "title": "Add Motoko-backed Transactions storage and connect frontend transactions workflow to backend",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Implement a per-authenticated-user Transactions data model and CRUD API in the Motoko backend to persist credit card spend records (date, merchant, amount, currency, category, card label, notes, raw description) and support bulk insert for CSV imports.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create app"
        ]
      },
      "acceptanceCriteria": [
        "Backend defines a Transaction record type that includes: id, date, merchant, amount, currency, category, cardLabel, notes, rawDescription.",
        "Backend stores transactions keyed by caller Principal so each authenticated user can only access their own data.",
        "Backend exposes update methods to: create a transaction, update a transaction, delete a transaction, list all transactions for the caller, and bulk-create transactions (for CSV import).",
        "All transaction methods enforce the same access-control checks used by existing profile/reward methods (trap/deny when caller lacks #user permission).",
        "Transaction IDs are generated server-side and are stable/unique within a user’s transaction set.",
        "Listing transactions returns an empty list when the user has no data (no traps for empty state)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Replace the frontend localStorage-based transactions implementation with backend-persisted transactions using the authenticated actor, while keeping the existing Transactions UI/UX (add/edit/delete, filters, table, dialogs) working end-to-end.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create app"
        ]
      },
      "acceptanceCriteria": [
        "The React Query hooks in frontend/src/hooks/useTransactions.ts fetch and mutate transactions via the backend actor instead of using localStorage.",
        "Add, edit, and delete actions in the Transactions page update backend data and automatically refresh the table using React Query invalidation.",
        "The CSV import wizard imports transactions by calling the backend bulk-create endpoint through the updated hook and shows the same success/error toast behavior.",
        "When the user logs out and logs back in with a different Internet Identity, transactions displayed are scoped to the currently authenticated user (no cross-user leakage)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Ensure all spending analytics and reward points estimate calculations use the backend-persisted transactions dataset (not localStorage), so Dashboard analytics reflect the same transactions shown on the Transactions page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create app"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard charts/insights and the points estimate summary use the same transactions query source as the Transactions page after the backend migration of hooks.",
        "After importing or adding a transaction, navigating to the Dashboard reflects updated analytics without requiring a manual refresh.",
        "Empty-state behavior remains correct on Dashboard when the backend returns no transactions."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: implement all Motoko transaction logic in backend/main.mo.",
    "Do not modify any frontend paths listed as immutable: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Implementing external database storage or third-party APIs.",
    "Changing the existing overall Transactions UI design, filters, or CSV mapping flow beyond what is required to switch persistence from localStorage to the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}