{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Migrate transactions workflow from localStorage to Motoko backend actor",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Replace localStorage transactions with backend-persisted transactions via the authenticated actor while keeping existing Transactions UI/UX working end-to-end.",
      "acceptanceCriteria": [
        "The React Query hooks in frontend/src/hooks/useTransactions.ts fetch and mutate transactions via the backend actor instead of using localStorage.",
        "Add, edit, and delete actions in the Transactions page update backend data and automatically refresh the table using React Query invalidation.",
        "The CSV import wizard imports transactions by calling the backend bulk-create endpoint through the updated hook and shows the same success/error toast behavior.",
        "When the user logs out and logs back in with a different Internet Identity, transactions displayed are scoped to the currently authenticated user (no cross-user leakage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTransactions.ts",
          "operation": "modify",
          "description": "Replace localStorage query/mutations with backend actor calls (getTransactions/createTransaction/updateTransaction/deleteTransaction/bulkImportTransactions) using useActor; gate queries on actor availability, handle authorization failures gracefully, and keep the existing toast success/error behavior with React Query invalidation."
        },
        {
          "path": "frontend/src/types/transactions.ts",
          "operation": "modify",
          "description": "Align the frontend Transaction type (especially id and currency) with the backend interface so backend-returned transactions can be displayed/edited without type mismatches; ensure helpers (formatting/parsing) remain compatible."
        },
        {
          "path": "frontend/src/components/transactions/TransactionForm.tsx",
          "operation": "modify",
          "description": "Ensure add/edit flows use the updated mutations from useTransactions and correctly pass backend-backed transaction ids/types; keep current validation and UI behavior unchanged."
        },
        {
          "path": "frontend/src/components/transactions/TransactionsTable.tsx",
          "operation": "modify",
          "description": "Update delete/edit actions to work with backend-backed transaction ids (as returned by the backend) and keep the existing confirmation dialog and table interactions unchanged."
        },
        {
          "path": "frontend/src/components/transactions/CsvImportWizard.tsx",
          "operation": "modify",
          "description": "Keep the existing CSV upload/mapping/preview flow, but route the final import through the updated bulk import hook so it persists to the backend and preserves existing success/error toast behavior."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Ensure Dashboard analytics and points estimates use the backend-persisted transactions dataset and update automatically after mutations/imports.",
      "acceptanceCriteria": [
        "Dashboard charts/insights and the points estimate summary use the same transactions query source as the Transactions page after the backend migration of hooks.",
        "After importing or adding a transaction, navigating to the Dashboard reflects updated analytics without requiring a manual refresh.",
        "Empty-state behavior remains correct on Dashboard when the backend returns no transactions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Confirm Dashboard continues to read transactions exclusively via useTransactions (now backed by the actor), and ensure empty/loading states remain correct when the backend returns an empty list."
        },
        {
          "path": "frontend/src/components/dashboard/PointsEstimateSummary.tsx",
          "operation": "modify",
          "description": "Verify points estimate calculations remain compatible with backend-returned Transaction typing after the migration (no localStorage coupling) and keep existing empty-state messaging."
        }
      ]
    }
  ]
}